In [21]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import matplotlib
matplotlib.rcParams['font.family']='NanumGothic'
matplotlib.rcParams['axes.unicode_minus'] = False

In [22]:
np.random.seed(100)
data = np.random.randint( 30 , 101, size=(9,6))

In [23]:
df = pd.DataFrame(data)
df

    0   1   2   3   4   5
0  38  54  97  78  40  82
1  83  96  44  64  54  45
2  90  88  46  39  32  57
3  34  61  31  43  34  89
4  97  37  79  77  95  91
5  44  85  32  49  93  83
6  57  86  60  78  77  69
7  68  74  48  94  86  64
8  83  47  43  60  47  83

In [24]:
df['년도'] = [2023,2023,2023,2024,2024,2024,2025,2025,2025]
df['학년'] = [ '1학년','2학년','3학년','1학년','2학년','3학년','1학년','2학년','3학년']

In [25]:
# 멀티 인덱스 : 두개 이상의 컬럼을 인덱스로 선택 
df.set_index( ['년도','학년'] , inplace=True)

In [26]:
df.reset_index(inplace=True) # 인덱스를 다시 복원

In [27]:
df.index = pd.MultiIndex.from_product([[2023,2024,2025],['1학년','2학년','3학년']])

In [28]:
df.drop(columns=['년도','학년'],inplace=True)

In [30]:
df.index

MultiIndex([(2023, '1학년'),
            (2023, '2학년'),
            (2023, '3학년'),
            (2024, '1학년'),
            (2024, '2학년'),
            (2024, '3학년'),
            (2025, '1학년'),
            (2025, '2학년'),
            (2025, '3학년')],
           )

In [31]:
df.index.levels

FrozenList([[2023, 2024, 2025], ['1학년', '2학년', '3학년']])

In [33]:
df.index.get_level_values(0) #전체 인덱스를 다 보여줌

Index([2023, 2023, 2023, 2024, 2024, 2024, 2025, 2025, 2025], dtype='int64')

In [34]:
df.index.get_level_values(1)

Index(['1학년', '2학년', '3학년', '1학년', '2학년', '3학년', '1학년', '2학년', '3학년'], dtype='object')

In [36]:
df.loc[2023]

      0   1   2   3   4   5
1학년  38  54  97  78  40  82
2학년  83  96  44  64  54  45
3학년  90  88  46  39  32  57

In [37]:
idx = pd.IndexSlice

- df.loc[ idx[행조건], idx[열조건]]
- df.loc[ idx[1번째,2번째], idx[1번째열,2번째열]]

In [39]:
df.loc[ idx[ 2024: ], :] #2024년부터 끝까지

           0   1   2   3   4   5
2024 1학년  34  61  31  43  34  89
     2학년  97  37  79  77  95  91
     3학년  44  85  32  49  93  83
2025 1학년  57  86  60  78  77  69
     2학년  68  74  48  94  86  64
     3학년  83  47  43  60  47  83

In [ ]:
df.loc[ idx[ 2024:,'2학년':], :] #2024년 2학년부터 끝까지

           0   1   2   3   4   5
2024 2학년  97  37  79  77  95  91
     3학년  44  85  32  49  93  83
2025 2학년  68  74  48  94  86  64
     3학년  83  47  43  60  47  83

In [43]:
df.loc[ idx[[2023,2025]], : ]

           0   1   2   3   4   5
2023 1학년  38  54  97  78  40  82
     2학년  83  96  44  64  54  45
     3학년  90  88  46  39  32  57
2025 1학년  57  86  60  78  77  69
     2학년  68  74  48  94  86  64
     3학년  83  47  43  60  47  83

In [45]:
df.loc[ idx[[2023,2025],['1학년','3학년']], : ]

           0   1   2   3   4   5
2023 1학년  38  54  97  78  40  82
     3학년  90  88  46  39  32  57
2025 1학년  57  86  60  78  77  69
     3학년  83  47  43  60  47  83

In [46]:
df.loc[ idx[::2,['1학년','3학년']], : ]

           0   1   2   3   4   5
2023 1학년  38  54  97  78  40  82
     3학년  90  88  46  39  32  57
2025 1학년  57  86  60  78  77  69
     3학년  83  47  43  60  47  83

In [50]:
# Q) 각 년도별 1학년 값 가져오기
df.loc[ idx[ : , ['1학년'] ], : ]

           0   1   2   3   4   5
2023 1학년  38  54  97  78  40  82
2024 1학년  34  61  31  43  34  89
2025 1학년  57  86  60  78  77  69

In [44]:
df

           0   1   2   3   4   5
2023 1학년  38  54  97  78  40  82
     2학년  83  96  44  64  54  45
     3학년  90  88  46  39  32  57
2024 1학년  34  61  31  43  34  89
     2학년  97  37  79  77  95  91
     3학년  44  85  32  49  93  83
2025 1학년  57  86  60  78  77  69
     2학년  68  74  48  94  86  64
     3학년  83  47  43  60  47  83

In [51]:
df.columns = pd.MultiIndex.from_product([['홍길동','이순신','임꺽정'],['국어','영어']])

In [ ]:
## 멀티인덱스 인덱싱슬라이싱은 컬럼이 반드시 정렬되어 있어야 한다.
df.sort_index(axis=1, inplace=True) #level=1

In [ ]:
df.loc[ :, idx[ '임꺽정':, : ]]

         임꺽정 홍길동
          영어  영어
2023 1학년  82  54
     2학년  45  96
     3학년  57  88
2024 1학년  89  61
     2학년  91  37
     3학년  83  85
2025 1학년  69  86
     2학년  64  74
     3학년  83  47

In [59]:
df.loc[ :, idx[ '임꺽정':, '영어' ]]

         임꺽정 홍길동
          영어  영어
2023 1학년  82  54
     2학년  45  96
     3학년  57  88
2024 1학년  89  61
     2학년  91  37
     3학년  83  85
2025 1학년  69  86
     2학년  64  74
     3학년  83  47

In [61]:
df.loc[ :, idx[ ::2, '영어' ]]

         이순신 홍길동
          영어  영어
2023 1학년  78  54
     2학년  64  96
     3학년  39  88
2024 1학년  43  61
     2학년  77  37
     3학년  49  85
2025 1학년  78  86
     2학년  94  74
     3학년  60  47

In [62]:
df.loc[ :, idx[ ['이순신','홍길동'], '영어' ]]

         이순신 홍길동
          영어  영어
2023 1학년  78  54
     2학년  64  96
     3학년  39  88
2024 1학년  43  61
     2학년  77  37
     3학년  49  85
2025 1학년  78  86
     2학년  94  74
     3학년  60  47

In [ ]:
# 2024,2025 2학년~3학년 이순신,홍길동 영어 값 추출
df.loc[idx[2024:,'2학년':] , idx[ ['이순신','홍길동'], '영어' ]]

         이순신 홍길동
          영어  영어
2024 2학년  77  37
     3학년  49  85
2025 2학년  94  74
     3학년  60  47

In [ ]:
df

         이순신     임꺽정     홍길동
          국어  영어  국어  영어  국어  영어
2023 1학년  97  78  40  82  38  54
     2학년  44  64  54  45  83  96
     3학년  46  39  32  57  90  88
2024 1학년  31  43  34  89  34  61
     2학년  79  77  95  91  97  37
     3학년  32  49  93  83  44  85
2025 1학년  60  78  77  69  57  86
     2학년  48  94  86  64  68  74
     3학년  43  60  47  83  83  47